// 1 Вивести числа від 20 до 30 через пропуск, використовуючи крок 0,5 (20 20,5 21 21,5….).

let str = '20'
for(let n = 20.5;n<=30;n=n+0.5){
    str=str+" "+n;
}
console.log(str);





// 2 Один долар коштує 27 гривень. Вивести дані з розрахунком вартості 10, 20, 30... 100 доларів.
/*
for (let i = 10; i <= 100; i = i + 10) {
    console.log("For " +i+ " USD you will receive "+ i*27+ " UAH");
}
*/



//3 Дане ціле число. Вивести всі цілі числа від 1 до 100, квадрат яких не перевищує числа N.
/*
let n  = prompt("Введіть число");
for (let i = 1; i <= 100 ; i++ ){
    if(i**2<n){
    console.log(i);
    }
}
*/



// 4 Дане ціле число. З'ясувати, чи є воно простим (простим називається число, більше 1, 
//   які не мають інших дільників крім 1 і себе).
/*
let n  = prompt("Введіть число")
simpleNumber:
for(let i = 2; i <= n ; i++) {
    for (let j = 2; j < i; j++){
        if (i % j == 0) continue simpleNumber;
    } 
   console.log(i); 
}
*/


// 5 Дане деяке число. Визначити, чи можна одержати 
//   це число шляхом зведення числа 3 у деякий ступінь. 
//   (Наприклад, числа 9, 81 можна отримати, а 13 - не можна).
/*
let n = prompt ('Введіть число')
for (let i = 0; i <= n; i++) {
     if (3**i == n){
        console.log("Можно!"+n+" це 3 в ступіні "+ i);
     };
}
*/